In [1]:
%pwd

'C:\\Users\\student\\Anaconda_src\\S01_Pyton_Review'

In [1]:
# Pandas Basics
from IPython.display import Image 

from pandas import Series, DataFrame, MultiIndex
import pandas as pd
import numpy as np

In [2]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.599215
   2    1.144306
   3    0.897379
b  1   -0.893921
   2   -0.634036
   3    0.997329
c  1   -0.959848
   2    1.628994
d  2   -0.380920
   3    0.222786
dtype: float64

In [3]:
ser = Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [4]:
ser.iloc[-1]

2.0

In [5]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [6]:
ser2[-1]

2.0

In [7]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [8]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [9]:
ser.iloc[:1]

0    0.0
dtype: float64

In [10]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [11]:
ser3.iloc[2]

2

In [17]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [19]:
frame.sort_index()

   0  1
0  2  3
1  4  5
2  0  1

In [20]:
frame.sort_values(by=[0])

   0  1
2  0  1
0  2  3
1  4  5

In [13]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

In [14]:
frame.iloc[:2]

   0  1
2  0  1
0  2  3

In [15]:
frame.iloc[::-1]

   0  1
1  4  5
0  2  3
2  0  1

In [ ]:
pd.to

In [ ]:
pd.re

In [21]:
download = pd.read_html('http://kind.krx.co.kr/corpgeneral/corpList.do?method=download', header=0)

In [22]:
type(download)

list

In [23]:
len(download)

1

In [24]:
type(download[0])

pandas.core.frame.DataFrame

In [25]:
corp_df = download[0]
corp_df.head()

,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
0,DL,210,기타 금융업,지주회사,1976-02-02,12월,전병욱,http://www.dlholdings.co.kr,서울특별시
1,DRB동일,4840,고무제품 제조업,"고무벨트(V벨트,콘베이어벨트,평벨트),프라스틱제품 제조,판매",1976-05-21,12월,류영식,http://drbworld.com,부산광역시
2,DSR,155660,1차 비철금속 제조업,합섬섬유로프,2013-05-15,12월,홍석빈,http://www.dsr.com,부산광역시
3,GS,78930,기타 금융업,지주회사/부동산 임대,2004-08-05,12월,"허태수, 홍순기 (각자 대표이사)",NaN,서울특별시
4,KG케미칼,1390,기초 화학물질 제조업,"콘크리트혼화제, 비료, 친환경농자재, 수처리제",1989-08-25,12월,"곽정현, 김재익",http://www.kgchem.co.kr,울산광역시

In [26]:
len(corp_df)

2498

In [27]:
corp_df.tail()

,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
2493,타임기술,318660,소프트웨어 개발 및 공급업,"ILS(종합군수지원), IETM(전자식기술교범), CBT(전자식교보재), 기술번역",2021-06-24,12월,주양효,http://timett.co.kr,경상남도
2494,틸론,217880,소프트웨어 개발 및 공급업,"Cloud Solution (D,A,E,Rstation)",2015-05-28,12월,최백준,http://www.tilon.co.kr,서울특별시
2495,플럼라인생명과학,222670,자연과학 및 공학 연구개발업,"강아지암치료제,돼지DNA테라피",2015-07-28,12월,김앤토니경태,http://www.plsdna.com,서울특별시
2496,한국미라클피플사,331660,기타 화학제품 제조업,"은나노스텝, 닥터오렌지 등",2019-10-28,12월,이호경,http://www.kmpc.co.kr,경기도
2497,휴벡셀,212310,의료용 기기 제조업,척추용 임플란트 등,2016-07-26,12월,"박정민, 허성규(각자대표)",http://huvexel.com,경기도

In [28]:
%dir *html

UsageError: Line magic function `%dir` not found.

In [29]:
%pwd download

'C:\\Users\\student\\Anaconda_src\\S01_Pyton_Review'

In [63]:
df = pd.read_excel('./data/Stock_Corporations.xlsx')
df.head(3)

,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
0,DL,210,기타 금융업,지주회사,1976-02-02,12월,전병욱,http://www.dlholdings.co.kr,서울특별시
1,DRB동일,4840,고무제품 제조업,"고무벨트(V벨트,콘베이어벨트,평벨트),프라스틱제품 제조,판매",1976-05-21,12월,류영식,http://drbworld.com,부산광역시
2,DSR,155660,1차 비철금속 제조업,합섬섬유로프,2013-05-15,12월,홍석빈,http://www.dsr.com,부산광역시

In [52]:
len(df)

2498

In [50]:
df.tail(3)

              High     Low    Open   Close  Volume  Adj Close
Date
2022-05-26  3.0355  3.0355  3.0355  3.0355     0.0     3.0355
2022-05-27  2.9925  2.9925  2.9925  2.9925     0.0     2.9925
2022-05-30  3.0640  3.0640  3.0640  3.0640     0.0     3.0640

In [64]:
# pandas data frame을 '상장일' 기준으로 정렬 (ascending=[True], [False]로 오름차순, 내림차순 정렬)
df = df.sort_values(['상장일'], ascending=False) 
df.head(3)

,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
962,마스턴프리미어리츠,357430,부동산 임대 및 공급업,"프랑스 파리 소재 크리스탈파크, 프랑스 아마존 라스트마일 물류센터, 인천 항동 스마...",2022-05-31,03월,도병운,http://masternpremier.com,서울특별시
602,하나금융22호스팩,418170,금융 지원 서비스업,기업인수합병,2022-05-26,12월,전재천,NaN,서울특별시
1667,가온칩스,399720,반도체 제조업,설계 솔루션 및 주문형 반도체,2022-05-20,12월,정규동,http://www.gaonchips.com,경기도

In [54]:
df.지역.unique()

array(['서울특별시', '경기도', '인천광역시', '부산광역시', '제주특별자치도', '경상남도', '충청북도',
       '광주광역시', '대구광역시', '충청남도', '경상북도', '울산광역시', '전라북도', '전라남도', '대전광역시',
       '강원도', '세종특별자치시', '케이맨 제도', '미국', '홍콩', '일본', '싱가포르'], dtype=object)

In [65]:
df[df.지역 == '전라북도'].head(3)

,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
2226,일진하이솔루스,271940,그외 기타 운송장비 제조업,"수소승용용기, 매연저감장치 등",2021-09-01,12월,안홍상,http://hysolus.co.kr,전라북도
2006,비나텍,126340,일차전지 및 축전지 제조업,초고용량 커패시터(슈퍼커패시터),2020-09-23,12월,성도경,http://www.vina.co.kr,전라북도
33,두산퓨얼셀,336260,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업",연료전지,2019-10-18,12월,"정형락, 제후석 (각자 대표이사)",http://www.doosanfuelcell.com,전라북도

In [66]:
df.지역.count()

2498

In [74]:
mask = (df.지역 == '광주광역시') | (df.지역 == '전라북도' ) | (df.지역 == '전라남도' )

In [75]:
honam_df = df[mask]
honam_df.head(3)

,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
2226,일진하이솔루스,271940,그외 기타 운송장비 제조업,"수소승용용기, 매연저감장치 등",2021-09-01,12월,안홍상,http://hysolus.co.kr,전라북도
2006,비나텍,126340,일차전지 및 축전지 제조업,초고용량 커패시터(슈퍼커패시터),2020-09-23,12월,성도경,http://www.vina.co.kr,전라북도
787,박셀바이오,323990,자연과학 및 공학 연구개발업,"항암면역세포치료제(자연살해세포, 수지상세포, CAR-T 및 인터루킨 기반 항암제)",2020-09-22,12월,이제중 (단독 대표이사),http://www.vaxcell-bio.com,전라남도

In [76]:
len(honam_df)

73

In [77]:
honam_corp = honam_df[['회사명', '종목코드']]
honam_corp.head(3)

          회사명    종목코드
2226  일진하이솔루스  271940
2006      비나텍  126340
787     박셀바이오  323990

In [78]:
honam_corp = honam_corp.rename(columns={'회사명': 'Corp.Honam', '종목코드': 'Code.KS'})
honam_corp.head(3)

     Corp.Honam  Code.KS
2226    일진하이솔루스   271940
2006        비나텍   126340
787       박셀바이오   323990

In [82]:
# import pandas.io.data as web
import pandas_datareader as web
from datetime import datetime

In [83]:
web.get_data_yahoo('YOJ.SG')

              High     Low    Open   Close  Volume  Adj Close
Date
2017-05-31  4.0000  4.0000  4.0000  4.0000     0.0   9.376454
2017-06-01  3.9520  3.9520  3.9520  3.9520     0.0   9.263937
2017-06-02  3.9130  3.9130  3.9130  3.9130     0.0   9.172517
2017-06-05  3.9130  3.9130  3.9130  3.9130     0.0   9.172517
2017-06-06  3.9320  3.9250  3.9250  3.9320     0.0   9.217055
...            ...     ...     ...     ...     ...        ...
2022-05-24  3.0780  3.0780  3.0780  3.0780     0.0   3.078000
2022-05-25  3.0230  3.0230  3.0230  3.0230     0.0   3.023000
2022-05-26  3.0355  3.0355  3.0355  3.0355     0.0   3.035500
2022-05-27  2.9925  2.9925  2.9925  2.9925     0.0   2.992500
2022-05-30  3.0640  3.0640  3.0640  3.0640     0.0   3.064000

[1267 rows x 6 columns]

In [47]:
# 방법1 
# df = web.DataReader('주식 종목코드')
# df = web.DataReader('AAPL')
df = web.get_data_yahoo('YOJ.SG')
df.head()

             High    Low   Open  Close  Volume  Adj Close
Date
2017-05-31  4.000  4.000  4.000  4.000     0.0   9.376454
2017-06-01  3.952  3.952  3.952  3.952     0.0   9.263937
2017-06-02  3.913  3.913  3.913  3.913     0.0   9.172517
2017-06-05  3.913  3.913  3.913  3.913     0.0   9.172517
2017-06-06  3.932  3.925  3.925  3.932     0.0   9.217055

In [81]:
honam_corp.to_excel('./data/Honam_Stock.xlsx')

In [84]:
# 방법2 : 기간정보(yyyy-mm-dd)
df = web.get_data_yahoo('035720.KS', start='2020-01-01')    # 카카오. 035720
df.head()

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-01-02,31127.228516,30623.552734,31026.494141,30724.287109,1196436.0,30697.591797
2020-01-03,31227.964844,30422.082031,30925.757812,30724.287109,1562748.0,30697.591797
2020-01-06,31227.964844,30220.611328,30321.345703,31127.228516,1954204.0,31100.181641
2020-01-07,32235.318359,31127.228516,31227.964844,32235.318359,4170263.0,32207.308594
2020-01-08,32638.259766,31530.169922,31933.111328,32134.582031,4227010.0,32106.660156

In [85]:
# 방법3 : 기간정보(datetime)
start = datetime(2022,1,1)
end   = datetime(2022,5,31)

In [87]:
df = web.get_data_yahoo('035720.KS', start, end)   # 삼성전자. 005930
df

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2022-01-04,115342.000000,111816.257812,114838.320312,112319.937500,2378714.0,112319.937500
2022-01-05,111816.257812,105772.132812,111816.257812,106275.812500,5071136.0,106275.812500
2022-01-06,103757.429688,100634.632812,103253.750000,100735.367188,7068448.0,100735.367188
2022-01-07,102246.398438,100533.898438,100735.367188,100735.367188,3933744.0,100735.367188
2022-01-10,101239.046875,95900.070312,100735.367188,97310.367188,5338491.0,97310.367188
...,...,...,...,...,...,...
2022-05-25,82000.000000,80300.000000,81000.000000,81800.000000,1365261.0,81800.000000
2022-05-26,83300.000000,81000.000000,81900.000000,81500.000000,1338305.0,81500.000000
2022-05-27,83000.000000,81500.000000,82400.000000,81700.000000,1038755.0,81700.000000
2022-05-30,84000.000000,82600.000000,82800.000000,83900.000000,2091429.0,83900.000000
2022-05-31,84100.000000,82900.000000,84100.000000,84000.000000,689640.0,84000.000000

In [103]:
df = web.get_data_yahoo('035720.KS', start, end)   # 삼성전자. 005930
df.describe()
df.idxmax()
df2 = web.get_data_yahoo('035720.KS', datetime(2022,1,4),datetime(2022,1,6))   # 삼성전자. 005930
df3 = df2.astype('int64')
df3

              High     Low    Open   Close   Volume  Adj Close
Date
2022-01-04  115342  111816  114838  112319  2378714     112319
2022-01-05  111816  105772  111816  106275  5071136     106275
2022-01-06  103757  100634  103253  100735  7068448     100735